Revit 2027 API
StructuralSectionAnalysisParams Constructor
Overload List
Name | Description
StructuralSectionAnalysisParams() |  Creates a new instance of StructuralSectionAnalysisParams.
StructuralSectionAnalysisParams(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Creates a new instance of StructuralSectionAnalysisParams.
Top
See Also
Reference
StructuralSectionAnalysisParams Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace